#include "iostream"
// Після того як я обрав директиву я обираю пространство std щоб скоротити код
using namespace std;

int main()
{
    

    int S, P, a, b;
    //Написав змінні ,вирішив не писати через float бо в основному у нас у таких задачах идуть натуральні числа
    cout << "  a :";
    cin >> a;
    cout << "  b :";
    cin >> b;
    //Написав ті змінні які повинен вводити користувач
    S = a * b;
    P = 2 * (a + b);
    //Тут написаний код за яким будуть обчислюватися значення
    cout << "  Perimetr: " << P << endl;
    cout << "Area: " << S << endl;
    //Виведення результату
    return 0;
}